Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMR21_DFP/2.0.42/atdf/ATSAMR21G16A.atdf
            <register-group name="USER_FUSES" name-in-module="USER_FUSES" address-space="fuses" offset="0x00804000"/>
          </instance>
        </module>
        <module name="PAC" id="U2211" version="1.0.1">
          <instance name="PAC0">
            <register-group name="PAC0" name-in-module="PAC" address-space="base" offset="0x40000000"/>
            <parameters>
              <param name="WPROT_DEFAULT_VAL" value="0x00000000" caption="PAC protection mask at reset"/>
              <param name="INSTANCE_ID" value="0"/>
            </parameters>
          </instance>
          <instance name="PAC1">
            <register-group name="PAC1" name-in-module="PAC" address-space="base" offset="0x41000000"/>
            <parameters>
              <param name="WPROT_DEFAULT_VAL" value="0x00000002" caption="PAC protection mask at reset"/>
              <param name="INSTANCE_ID" value="32"/>
            </parameters>
          </instance>
          <instance name="PAC2">
            <register-group name="PAC2" name-in-module="PAC" address-space="base" offset="0x42000000"/>
            <parameters>
              <param name="WPROT_DEFAULT_VAL" value="0x00800000" caption="PAC protection mask at reset"/>
              <param name="INSTANCE_ID" value="64"/>
            </parameters>
          </instance>
        </module>
        <module name="PM" id="U2206" version="2.0.1">
          <instance name="PM">
            <register-group name="PM" name-in-module="PM" address-space="base" offset="0x40000400"/>
            <signals>
              <signal group="RESET_N" function="default" pad="RESET_N"/>
            </signals>
            <parameters>
              <param name="CTRL_MCSEL_DFLL48M" value="3"/>
              <param name="CTRL_MCSEL_GCLK" value="0"/>
              <param name="CTRL_MCSEL_OSC8M" value="1"/>
              <param name="CTRL_MCSEL_XOSC" value="2"/>
              <param name="PM_CLK_APB_NUM" value="2"/>
              <param name="INSTANCE_ID" value="1"/>
            </parameters>
            <clock-groups>
              <clock-group name="AHB" grouporder="0">
                <clock name="HPB0" bit="0"/>
                <clock name="HPB1" bit="1"/>
                <clock name="HPB2" bit="2"/>
                <clock name="DSU" bit="3"/>
                <clock name="NVMCTRL" bit="4"/>
                <clock name="DMAC" bit="5"/>
                <clock name="USB" bit="6"/>
              </clock-group>
            </clock-groups>
          </instance>
        </module>
        <module name="PORT" id="U2210" version="1.0.0">
          <instance name="PORT">
            <register-group name="PORT" name-in-module="PORT" address-space="base" offset="0x41004400"/>
            <register-group name="PORT_IOBUS" name-in-module="PORT" address-space="base" offset="0x60000000"/>
            <signals>
              <signal group="P" index="0" function="default" pad="PA00"/>
              <signal group="P" index="1" function="default" pad="PA01"/>
              <signal group="P" index="4" function="default" pad="PA04"/>
              <signal group="P" index="5" function="default" pad="PA05"/>
              <signal group="P" index="6" function="default" pad="PA06"/>
              <signal group="P" index="7" function="default" pad="PA07"/>
              <signal group="P" index="8" function="default" pad="PA08"/>
              <signal group="P" index="9" function="default" pad="PA09"/>
              <signal group="P" index="10" function="default" pad="PA10"/>
              <signal group="P" index="11" function="default" pad="PA11"/>
              <signal group="P" index="12" function="default" pad="PA12"/>
              <signal group="P" index="13" function="default" pad="PA13"/>
              <signal group="P" index="14" function="default" pad="PA14"/>
              <signal group="P" index="15" function="default" pad="PA15"/>
              <signal group="P" index="16" function="default" pad="PA16"/>
              <signal group="P" index="17" function="default" pad="PA17"/>
              <signal group="P" index="18" function="default" pad="PA18"/>
              <signal group="P" index="19" function="default" pad="PA19"/>
              <signal group="P" index="20" function="default" pad="PA20"/>
              <signal group="P" index="22" function="default" pad="PA22"/>
              <signal group="P" index="23" function="default" pad="PA23"/>
              <signal group="P" index="24" function="default" pad="PA24"/>
              <signal group="P" index="25" function="default" pad="PA25"/>
              <signal group="P" index="27" function="default" pad="PA27"/>
              <signal group="P" index="28" function="default" pad="PA28"/>
              <signal group="P" index="30" function="default" pad="PA30"/>
              <signal group="P" index="31" function="default" pad="PA31"/>
              <signal group="P" index="32" function="default" pad="PB00"/>
              <signal group="P" index="34" function="default" pad="PB02"/>
              <signal group="P" index="35" function="default" pad="PB03"/>
              <signal group="P" index="40" function="default" pad="PB08"/>
              <signal group="P" index="41" function="default" pad="PB09"/>
              <signal group="P" index="46" function="default" pad="PB14"/>
              <signal group="P" index="47" function="default" pad="PB15"/>
              <signal group="P" index="48" function="default" pad="PB16"/>
              <signal group="P" index="49" function="default" pad="PB17"/>
              <signal group="P" index="54" function="default" pad="PB22"/>
              <signal group="P" index="55" function="default" pad="PB23"/>
              <signal group="P" index="62" function="default" pad="PB30"/>
              <signal group="P" index="63" function="default" pad="PB31"/>
              <signal group="P" index="80" function="default" pad="PC16"/>
              <signal group="P" index="82" function="default" pad="PC18"/>
              <signal group="P" index="83" function="default" pad="PC19"/>
            </signals>
            <parameters>
              <param name="BITS" value="84" caption="Number of PORT pins"/>
              <param name="DRVSTR" value="1" caption="DRVSTR supported"/>
              <param name="GROUPS" value="3" caption="Number of 32-bit PORT groups"/>
              <param name="ODRAIN" value="0" caption="ODRAIN supported"/>
              <param name="SLEWLIM" value="0" caption="SLEWLIM supported"/>
              <param name="INSTANCE_ID" value="35"/>
            </parameters>
          </instance>
        </module>
        <module name="PTC" id="U2215" version="1.0.2">
          <instance name="PTC">
            <register-group name="PTC" name-in-module="PTC" address-space="base" offset="0x42004C00"/>
            <signals>
              <signal group="X" index="0" function="B" pad="PA08"/>
              <signal group="X" index="1" function="B" pad="PA09"/>
              <signal group="X" index="2" function="B" pad="PA10"/>
              <signal group="X" index="3" function="B" pad="PA11"/>
              <signal group="X" index="4" function="B" pad="PA16"/>
              <signal group="X" index="5" function="B" pad="PA17"/>
              <signal group="X" index="6" function="B" pad="PA18"/>
              <signal group="X" index="7" function="B" pad="PA19"/>
              <signal group="X" index="8" function="B" pad="PA20"/>
              <signal group="X" index="10" function="B" pad="PA22"/>
              <signal group="X" index="11" function="B" pad="PA23"/>
              <signal group="X" index="14" function="B" pad="PB14"/>
              <signal group="X" index="15" function="B" pad="PB15"/>
              <signal group="Y" index="2" function="B" pad="PA04"/>
              <signal group="Y" index="3" function="B" pad="PA05"/>
              <signal group="Y" index="4" function="B" pad="PA06"/>
              <signal group="Y" index="5" function="B" pad="PA07"/>
              <signal group="Y" index="6" function="B" pad="PB00"/>
              <signal group="Y" index="8" function="B" pad="PB02"/>
              <signal group="Y" index="9" function="B" pad="PB03"/>
              <signal group="Y" index="14" function="B" pad="PB08"/>
              <signal group="Y" index="15" function="B" pad="PB09"/>
            </signals>
            <parameters>
              <param name="GCLK_ID" value="34" caption="Index of Generic Clock"/>
              <param name="INSTANCE_ID" value="83"/>
            </parameters>
          </instance>
        </module>
        <module name="RFCTRL" id="U2233" version="1.0.0">
          <instance name="RFCTRL">
            <register-group name="RFCTRL" name-in-module="RFCTRL" address-space="base" offset="0x42005400"/>
            <signals>
              <signal group="FECTRL" index="0" function="F" pad="PA08"/>
              <signal group="FECTRL" index="1" function="F" pad="PA09"/>
              <signal group="FECTRL" index="2" function="F" pad="PA12"/>
              <signal group="FECTRL" index="3" function="F" pad="PA13"/>
              <signal group="FECTRL" index="4" function="F" pad="PA14"/>
              <signal group="FECTRL" index="5" function="F" pad="PA15"/>
            </signals>
            <parameters>
              <param name="FBUSMSB" value="5"/>
              <param name="INSTANCE_ID" value="85"/>
            </parameters>
          </instance>
        </module>
        <module name="RTC" id="U2202" version="1.0.1">
          <instance name="RTC">
            <register-group name="RTC" name-in-module="RTC" address-space="base" offset="0x40001400"/>
            <parameters>
              <param name="ALARM_NUM" value="1" caption="Number of Alarms"/>
              <param name="COMP16_NUM" value="2" caption="Number of 16-bit Comparators"/>
              <param name="COMP32_NUM" value="1" caption="Number of 32-bit Comparators"/>
              <param name="GCLK_ID" value="4" caption="Index of Generic Clock"/>
              <param name="NUM_OF_ALARMS" value="1" caption="Number of Alarms (obsolete)"/>
              <param name="NUM_OF_COMP16" value="2" caption="Number of 16-bit Comparators (obsolete)"/>
              <param name="NUM_OF_COMP32" value="1" caption="Number of 32-bit Comparators (obsolete)"/>
              <param name="INSTANCE_ID" value="5"/>
            </parameters>
          </instance>
        </module>
        <module name="SERCOM" id="U2201" version="2.0.0">
          <instance name="SERCOM0">
            <register-group name="SERCOM0" name-in-module="SERCOM" address-space="base" offset="0x42000800"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PA04"/>
              <signal group="PAD" index="0" function="C" pad="PA08"/>
              <signal group="PAD" index="1" function="D" pad="PA05"/>
              <signal group="PAD" index="1" function="C" pad="PA09"/>
              <signal group="PAD" index="2" function="D" pad="PA06"/>
              <signal group="PAD" index="2" function="C" pad="PA10"/>
              <signal group="PAD" index="3" function="D" pad="PA07"/>
              <signal group="PAD" index="3" function="C" pad="PA11"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="1" caption="Index of DMA RX trigger"/>
              <param name="DMAC_ID_TX" value="2" caption="Index of DMA TX trigger"/>
              <param name="GCLK_ID_CORE" value="20" caption="Index of Generic Clock for Core"/>
              <param name="GCLK_ID_SLOW" value="19" caption="Index of Generic Clock for SMbus timeout"/>
              <param name="INT_MSB" value="6"/>
              <param name="INSTANCE_ID" value="66"/>
            </parameters>
          </instance>
          <instance name="SERCOM1">
            <register-group name="SERCOM1" name-in-module="SERCOM" address-space="base" offset="0x42000C00"/>
            <signals>
              <signal group="PAD" index="0" function="C" pad="PA16"/>
              <signal group="PAD" index="0" function="D" pad="PA00"/>
              <signal group="PAD" index="1" function="C" pad="PA17"/>
              <signal group="PAD" index="1" function="D" pad="PA01"/>
              <signal group="PAD" index="2" function="D" pad="PA30"/>
              <signal group="PAD" index="2" function="C" pad="PA18"/>
              <signal group="PAD" index="3" function="D" pad="PA31"/>
              <signal group="PAD" index="3" function="C" pad="PA19"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="3" caption="Index of DMA RX trigger"/>
              <param name="DMAC_ID_TX" value="4" caption="Index of DMA TX trigger"/>
              <param name="GCLK_ID_CORE" value="21" caption="Index of Generic Clock for Core"/>
              <param name="GCLK_ID_SLOW" value="19" caption="Index of Generic Clock for SMbus timeout"/>
              <param name="INT_MSB" value="6"/>
              <param name="INSTANCE_ID" value="67"/>
            </parameters>
          </instance>
